Repository: gunchleoc/M.A.R.S.
Catalog: po/*.po
Languages: ar

source: Start Local Game
ar: ابدأ لعبة محلية

source: Start Network Game
ar: أنشئ لعبة شبكة

source: Join Network Game
ar: اشترك في لعبة شبكة

source: Options
ar: الخيارات

source: About
ar: عن

source: Quit M.A.R.S.
ar: غادر M.A.R.S.

source: Continue
ar: استمر

source: Restart Game
ar: أعد اللعبة

source: Hide Menu
ar: أخفِ القائمة

source: Return to Main Menu
ar: عُد إلى القائمة الرئيسية

source: Start
ar: ابدأ

source: Cancel
ar: ألغِ

source: Info
ar: معلومات

source: Close
ar: أغلق

source: License
ar: الرخصة

source: Ok
ar: موافق

source: Show this Info again.
ar: أظهر هذه المعلومات مجددًا

source: Left Team
ar: الفريق الأيسر

source: Right Team
ar: الفريق الأيمن

source: Bots Left
ar: الآليون في اليسار

source: Bots Right
ar: الآليون في اليمين

source: Bots
ar: الآليون

source: Frag Limit
ar: الحد الأعلى للقتلات

source: In year 3547, civilizations all over the galaxy have settled their own planets, living in peace and harmony with its environment. But outside the contemplative habitats, the GREAT WAR is raging. As a famous fighter on your way to never ending honor and prosperity, you have to protect your planet from the oncoming doom of your jealous neighbours! Fight the battle, a true hero as you are was born for: SPACEBALL. Protect your planet from the sphere of death and defeat your enemies by letting it crush into their ridiculous globe.
ar: في العام 3547 استقرت كل حضارة في المجرة على كوكبها الخاص، حيث عاشت في سلام وانسجام مع طبيعته وأرضه.ولكن خارج هذا الجو الهادئ تشتعل نيران الحرب العظيمة.عليك أن تحمي كوكبك من الدمار الآتي من الجيران الحاسدين! فأنت المقاتل الشهير الذي يسعى إلى الفخر والازدهار.خض في الحرب فالبطل الحق مثلك يكون في: كرة الفضاء.احم كوكبك من كرة الموت وتغلب على أعدائك بجعلها تصطدم بعالمهم السخيف.

source: Kick or shoot the ball to your enemy's planet!
ar: اركل الكرة أو أطلق عليها لترتطم بكوكب عدوك!

source: As a result of the GREAT WAR you have lost everything: your home, your family and your self-esteem. Your last chance to get out of the miserable life you are stuck in, is to become a gladiator in the glorious DEATHMATCH-arena. Resist the other fighters and earn points by destroying the nutshells, they call ships. Prepare yourself! Death and Glory awaits you.
ar: نتيجةً للحرب العظيمة خسرت كل شيء، وطنك، وعائلتك، وثقتك بنفسك.آخر فرصة لك للخروج من هذا البؤس الذي حُبست فيه هي أن تكون محاربًا في ساحة القتال حتى الموت. قاوم المقاتلين الآخرين واكسب النقاط بتحطيم الخردة التي يسمونها سفنًا فضائية. كن مستعدًا! الموت والمجد ينتظرانك.

source: Destroy as many enemies as possible!
ar: حطم أكبر عدد ممكن من الأعداء!

source: The negotiations have failed! Both of you and your neighbours had to record enormous losses in conclusion of the abiding GREAT WAR. As a last attempt of gaining the upper hand, you are ordered to decimate your enemy's resources and to protect your own one's. The only way to do so is an epic TEAMDEATHMATCH. Protect your comrades and destroy your enemies! Teach them a lesson, they will never forget.
ar: لقد فشلت المفاوضات! وتكبدتَ وجيرانُك خسائر فادحة من جراء استمرار الحرب العظيمة. في آخر محاولة لتكون لك اليد العليا عليك القضاء على موارد الأعداء والحفاظ على مواردك. السبيل الوحيد لهذا هو قتال ملحمي في فِرَق حتى الموت. احمِ رفاقك واقضِ على أعداءك. لقنهم درسًا لن ينسوه!

source: As if the GREAT WAR was not enough, your planetary system is threatened by a new source of incredible evilness: A giant ship of unknown invaders is levitating over your galaxy, aiming on the home planets with a monolithic weapon of mass destruction. As a sign of cynicism, the attackers dropped a remote control to adjust this provenance of death and fear. Reach it first to turn your enemy's home planet into a place of desolation! Be the CANNONKEEPer.
ar: وكأن الحرب العظيمة لم تكن كافية. أصبح نظامك الكوكبي مهددًا من قِبل مصدر شر مهول جديد، سفينة ضخمة تابعة لغزاة مجهولين تحلق فوق مجرتك وتستهدف الكواكب المأهولة بسلاح دمار شامل فتاك. من شدة الاستخفاف ألقى المهاجمون جهاز تحكم عن بعد لضبط رأس الموت والرعب هذا. كن أول من يصل إليه حتى تجعل كوكب عدوك أرضًا للخراب! كن حارس المدفع!

source: Pick up the remote and keep it as long as possible!
ar: التقط جهاز التحكم واحتفظ به لأطول وقت ممكن!

source: Show Debug Information
ar: إظهار معلومات التصحيح

source: Bots Orientation
ar: توجه الآليين

source: Zones
ar: المناطق

source: AI-Paths
ar: المسارات

source: Show Game Information
ar: إظهار معلومات اللعبة

source: Frames per Second
ar: عدد الإطارات في الثانية

source: Particle Count
ar: عدد الجُسيمات

source: Particle Lifetime
ar: مدة بقاة الجُسيمات

source: Game Settings
ar: إعدادات اللعبة

source: Full screen
ar: ملء الشاشة

source: V-Sync
ar: المزامنة الرأسية

source: Music
ar: صوت الموسيقى

source: Sound
ar: صوت المؤثرات

source: Announcer
ar: صوت التعليق

source: Name
ar: الاسم

source: Accelerate
ar: التسريع

source: Turn Left
ar: الدوران لليسار

source: Turn Right
ar: الدوران لليمين

source: Weapon
ar: إطلاق السلاح

source: Ship
ar: السفينة

source: Player Color
ar: لون اللاعب

source: Team Color
ar: لون الفريق

source: File Format for Screenshots
ar: صيغة ملف لقطة الشاشة

source: This is a first attempt to create a game in OpenGL with SFML. It is a game for two players, flying with ships in a two-dimensional space setting, governed by the laws of gravity. Homepage: http://www.marsshooter.org© 2010-2011 Felix Lauer & Simon Schneegans
ar: هذه أولى محاولاتي لإنشاء لعبة في أوبن‌جي‌إل باستخدام SFML. إنها لعبة لشخصين يقودان سفنًا في مشهد فضائي ثنائي الأبعاد تحكمه قوانين الجاذبية. الموقع الإلكتروني: http://www.marsshooter.org

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 3 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. Available online under:http://www.gnu.org/licenses/gpl-3.0.html
ar: هذا البرنامج من البرمجيات الحرة. يحق لك توزيعه وتعديله تحت شروط رخصة غنو العمومية كما نشرتها مؤسسة البرمجيات الحرة، سواء النسخة الثالثة من الرخصة أو أي نسخة تالية (أيهما تشاء). يوزَّع هذا البرنامج على أمل أن يكون مفيدًا، ولكنه يأتي بلا أي نوع من الضمان، هذا يشمل ضمان الرواج أو المناسبة لغرض معين. اقرأ رخصة غنو العمومية لمزيد من التفاصيل. متوفرة عبر الإنترنت في الموقع التالي:http://www.gnu.org/licenses/gpl-3.0.html

source: Do you really want to quit?
ar: هل تود حقًا المغادرة؟

source: Do you really want to end the current game?
ar: هل تود حقًا إنهاء اللعبة الحالية؟

source: M.A.R.S. gaming over the world wide web or a local area network is a planned feature, but not implemented yet. Stay tuned!
ar: لعب M.A.R.S. على الشبكة العنكبوتية العالمية أو الشبكة المحلية جزء من خطتنا المستقبلية، ولكنه ليس متاحًا بعد. تابعونا!

source: You paused M.A.R.S. right in the middle of an insane battle? If you want to take a screenshot, this button enables you to generate epic wallpapers, by hiding all windows. Simply bring them back afterwards by pressing ESC.
ar: هل أوقفت اللعبة في لحظة حاسمة من المعركة؟ إذا أردت التقاط صورة للشاشة فهذا الزر يساعدك على تصوير خلفيات خرافية، ولذلك بأن يخفي كل النوافذ. يمكنك بعد ذلك استعادها ببساطة بالضغط على زر ESC.

source: Add
ar: زائد

source: Back Slash
ar: شرطة مائلة للخلف

source: Comma
ar: فاصلة

source: Dash
ar: شرطة

source: Divide
ar: قسمة

source: Down
ar: أسفل

source: Equal
ar: يساوي

source: Left Alt
ar: Alt الأيسر

source: Left Bracket
ar: قوس الإغلاق

source: Left Control
ar: Ctrl الأيسر

source: Left
ar: يسار

source: Left Shift
ar: Shift الأيسر

source: Left Super
ar: Super الأيسر

source: Multiply
ar: ضرب

source: Period
ar: نقطة

source: Quote
ar: علامة تنصيص فردية

source: Right Alt
ar: Alt الأيمن

source: Right Bracket
ar: قوس الفتح

source: Right Control
ar: Ctrl الأيمن

source: Right
ar: يمين

source: Right Shift
ar: Shift الأيمن

source: Right Super
ar: Super الأيمن

source: Semi Colon
ar: فاصلة منقوطة

source: Slash
ar: شرطة مائلة

source: Space
ar: مسافة

source: Subtract
ar: طرح

source: Up
ar: أعلى

source: Graphics
ar: الرسوميات

source: Audio
ar: الصوت

source: Window Settings
ar: إعدادات النوافذ

source: Start Tutorial
ar: ابدأ التدريب

source: Next
ar: التالي

source: Welcome, Space Rookie!
ar: مرحبًا أيها المبتدئ في الفضاء!

source: We are glad to recruit a rising hero like you, {PLAYER1_NAME}, to join us in the GREAT WAR!We figured out you needed some practice with your new ship.Let the training begin...
ar: يسعدنا أن نجند بطلاً صاعدًا مثلك لينضم إلينا في الحرب العظيمة!اكتشفنا أنك بحاجة إلى بعض التمرن على سفينتك الجديدة.فليبدأ التدريب!

source: Basic Movement...
ar: التحرك الأساسي

source: Controlling your ship is the most important task to master.All movement is governed by the laws of gravity. To decelerate you have to turn and accelerate in the opposite direction. Control your ship, using the keys <{PLAYER1_KEY_UP}>, <{PLAYER1_KEY_LEFT}> and <{PLAYER1_KEY_RIGHT}>!
ar: التحكم بسفينتك أهم مهمة عليك إتقانها.كل التحركات محكومة بقوانين الجاذبية. إذا أردت التباطؤ فعليك أن تسير في الجهة المعاكسة. ابدأ التحكم بسفينتك باستخدام المفاتيح:

source: Warming Up!
ar: الإحماء!

source: Reach the pink zone!Try not to crash your brand new ship.
ar: اذهب إلى المنطقة الوردية!حاول أن لا تحطم سفينتك الجديدة.

source: Well Done, {PLAYER1_NAME}!
ar: أحسنت!

source: Now head back to your home planet and try to land your ship by slowly floating back while approaching your planet.
ar: الآن عُد إلى كوكبك وحاول أن تهبط بسفينتك بالطيران إلى الوراء ببطء حتى تلامس الكوكب.

source: Good Work!
ar: عمل جيد!

source: Proper landing is not a piece of cake, is it?You should learn it by heart.
ar: الهبوط السليم ليس سهلاً، أليس كذلك؟عليك أن تتقنه جيدًا.

source: Something More Difficult...
ar: شيء أصعب قليلاً

source: Try to follow the path marked up by the pink zones!We will contact you again, after you have mastered this.Now go for it!
ar: حاول اتباع المسار الذي ترسمه النقاط الوردية.سوف نتصل بك مرة أخرى بعد أن تنجز هذا. انطلق الآن!

source: Awesome!
ar: رائع!

source: You are the best rookie we have ever seen.Now prepare yourself for some explosive stuff.
ar: أنت أفضل مبتدئ رأيته في حياتي.الآن استعد لبعض الانفجارات!

source: Shooting...
ar: إطلاق النار

source: To defeat your enemies, you have to know how to shoot them up!For that purpose press <{PLAYER1_KEY_FIRE}>. Have some fun shooting around and then land your ship to continue the tutorial.
ar: عليك أن تتعلم كيف تطلق على أعدائك حتى تتمكن من التغلب عليهم!لفعل ذلك اضغط زر

source: Good Landing, {PLAYER1_NAME}!
ar: هبوط جيد!

source: You turn out to be a great pilot.Now how about some more weapons?
ar: يبدو أنك طيار ممتاز.ما رأيك الآن بمزيد من الأسلحة؟

source: The Weapons...
ar: الأسلحة

source: We know you've been waiting for this. When docked you can switch through some incredibly evil weapons. Press <{PLAYER1_KEY_FIRE}> to open your arsenal.Then use <{PLAYER1_KEY_LEFT}> and <{PLAYER1_KEY_RIGHT}> to choose a weapon! Take-off, when you're ready!
ar: أعلم أنك كنت متلهفًا لهذا. أثناء رسوك تستطيع التبديل بين عدة أسلحة بالغة الخطورة.اضغط على زر

source: Fight!
ar: القتال!

source: Now let's see how you make it against a rookie from another planet. Seems like he is trying to improve his flying abilities.Beat him!
ar: لنرى الآن ماذا ستفعل أمام مبتدئ من كوكب آخر.يبدو أنه يتدرب على الطيران.اضربه!

source: Impressive!
ar: مذهل!

source: You did it! As you may have noticed, a little star appeared over your ship. The more enemies you kill, the more of them will show. But they are not only a frag indicator! Land again and we will show you what else stars are good for.
ar: لقد نجحت! ربما لاحظت أنك تحصل على بعض نقاط السمعة مقابل كل عدو تقتله.الرقم الأخضر الصغير الذي يظهر فوق سفينتك يمثل قيمتها. سوف تزداد القيمة إن قتلت كثيرًا من الأعداء على التوالي.

source: Beat Them!
ar: احذر!

source: Prove your skills! Score at least five points by killing them! Your current score is displayed next to your name!We will send in an experienced warrior assisting you, {PLAYER1_NAME}!
ar: لا وقت للراحة.لقد أرسل الأعداء أحد محاربيهم الحقيقيين للثأر!لا أملك لك شيئًا ...

source: Unbelievable!
ar: غير معقول!

source: You managed all our tasks successfully. Now what to do?Let's have a look at the options menu. There you can adjust a lot of... well... options.For example you may choose your ship style and color or change your name...
ar: لقد تمكنتَ من أداء جميع المهام جيدًا. ماذا نفعل الآن؟ لنلق نظرة على قائمة الخيارات. هناك تستطيع ضبط العديد من ال‍... ما اسمها؟ ... الخيارات.على سبيل المثال، يمكنك تغيير شكل سفينتك ولونها، ويمكنك تغيير اسمك.

source: Who's Best?
ar: من الأفضل؟

source: You can display a list of frags, points and so on via <{STATISTICS_KEY}>.Furthermore the numbers next to your name illustrate your frag counter and your distance to the best one.
ar: يمكنك عرض عدد القتلات والنقاط وغيرها بالضغط على زر <Tab>.الأرقام التي تلي اسمك تمثل عداد قتلاتك والفرق بينه وبين الأفضل.

source: Congratulations, {PLAYER1_NAME}!
ar: تهانينا!

source: You finished this tutorial. You are now ready to fight in the GREAT WAR. If you want to continue practising, just wait for the enemies to re-spawn. You can end your training with <Esc>.Have a great time with M.A.R.S.!
ar: لفد أتممت التدريب. أصبحت الآن مستعدًا للقتال في الحرب العظيمة. إن أردت الاستمرار في التمرن فانتظر حتى يولد العدو مرة أخرى. يمكنك إنهاء التدريب بالضغط على <Esc>.نتمنى لك وقتًا ممتعًا في M.A.R.S.!

source: You Failed!
ar: لقد أخفقت!

source: Awesome {PLAYER1_NAME}! You destroyed your brand new ship. All right, we will get you a new one. Just wait some seconds...
ar: رائع! لقد حطمت سفينتك الجديدة اللامعة! لا بأس، سنحضر لك سفينة جديدة. انتظر قليلاً ...

source: Did You Notice?
ar: هل لاحظت؟

source: Your life is draining! Keep an eye on the upper life bar. You better land if it's too empty.
ar: قوتك تقل! انتبه إلى الشريط الأخضر. ننصحك بالهبوط إذا أوشك على الانتهاء.

source: Your fuel is draining! Keep an eye on the yellow fuel bar. You better land if it's too empty.
ar: وقودك يقل! انتبه إلى الشريط الأصفر. ننصحك بالهبوط إذا أوشك على الانتهاء.

source: You Nearly Got Him!
ar: لقد أوشكت على النيل منه!

source: Watch your opponent's name. Its colour indicates his life points. The more it turns red, the weaker your enemy is.
ar: انتبه إلى اسم عدوك. اللون يدل على مقدار قوته المتبقية، كلما ازداد حمرة كلما كان أضعف.

source: Interface
ar: الواجهة

source: High Star Field Resolution
ar: جودة عالية للمجال النجمي

source: Language
ar: اللغة

source: Hot Key for Screenshots
ar: اختصار أخد لقطة للشاشة

source: Points
ar: النقاط

source: Frags
ar: القتلات

source: Teamkills
ar: قتلات الأصدقاء

source: Suicides
ar: الانتحارات

source: Deaths
ar: الموتات

source: Total:
ar: المجموع:

source: Statistics
ar: إحصائيات

source: Shader Effects
ar: مؤثرات المظلِّل

source: Sadly, shaders are not supported by your hardware!
ar: للأسف، عتادك لا يدعم المظللات!

source: Gameplay
ar: اللعب

source: PowerUp Spawn Rate
ar: معدل ظهور المساعدات

source: Bot Difficulty
ar: صعوبة الآليين

source: Explosions for Slow Motion
ar: عدد الانفجارات قبل الإبطاء

source: Off
ar: معطل

source: Credits
ar: إشادات

source: Special Thanks to:
ar: شكر خاص ل‍:

source: Translations: Arabic: Majid Chinese: Wecing Czech: Mates Finnish: Paavo French: Ludovic German: Atto Hindi: Antriksh & Aakanksh Hungarian: Papp Bence Italian: Proch Polish: command_dos Portuguese: Vitor Russian: Drakmail Spanish: Gastón Swedish: HenrikCoding support: Werner and DeubeuliouTests and creative support: Heinrich, Martin, Bastian, Sandra, Diana.
ar: الترجمات: الألمانية: Sandra الأسبانية: Gastón البرتغالية: Vitor الفرنسية: Astohan الروسية: Drakmail الإيطالية: Proch السويدية: Henrik العربية: Majidالاختبارات والدعم الإبداعي: Heinrich, Martin, Bastian, Sandra, Diana.

source: Resolution
ar: الجودة

source: Color Depth
ar: عمق الألوان

source: Special Ability
ar: استخدام الميزة

source: When this key is pressed, a screenshot is saved to {CONFIG_PATH}screenshots/
ar: When this key is pressed, a screen shot is saved to ~/.marsshooter/screenshots.

source: Pressing this key switches to the next music track.
ar: When this key is pressed, a screen shot is saved to the directory M.A.R.S.
